Autodesk.Navisworks.Api.ProgressUpdatingEventArgs
Event arguments used for the Application::ProgressUpdating event

Autodesk.Navisworks.Api.ProgressUpdatingEventArgs.Canceled
Sets a value indicating whether the operation should be canceled.

Autodesk.Navisworks.Api.ProgressUpdatingEventArgs.OverallFractionDone
Gets the fraction of the overall progress operation that has been done. Displayed in title bar
of Navisworks progress dialog.

Autodesk.Navisworks.Api.ProgressUpdatingEventArgs.Progress
Gets a reference to the Progress class instance relating to this Event.

Autodesk.Navisworks.Api.ProgressUpdatingEventArgs.SubOperationFractionDone
Gets the fraction of the current progress sub-operation that has been done. Displayed in the progress
bar of the Navisworks progress dialog.